[net]
batch=32
subdivisions=8
height=416
width=416
# max_crop=512
channels=3
momentum=0.9
decay=0.0005

learning_rate=0.001
max_batches=350000
policy=steps
steps=0,10000,70000,120000,190000,250000
scales=.1,10,.5,.5,.1,.1

hue=.1
saturation=.75
exposure=.75

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-9

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[reorg]
stride=2

[route]
layers=-1,-4

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
# num_of_anchor_box * (num_of_class + num_of_coords+ 1)
# filters=138
#filters=90
filters=66
size=1
stride=1
pad=1
activation=linear

[region]
#anchors = 0.49,0.19,  0.78,0.73,  1.37,2.12,  2.44,4.14,  4.74,6.27,  5.05,10.88
#anchors = 0.58,0.33,  0.90,1.01,  1.64,2.57,  2.56,5.17,  4.83,6.07,  5.16,10.83
#anchors = 0.63,0.70,  1.12,1.32,  1.89,2.39,  3.28,3.76,  4.55,6.05,  5.67,8.13
anchors = 0.619837,0.684908,  1.077251,1.261885,  1.783402,2.216456,  2.748489,3.67829,  4.375359,4.755277,  5.279055,7.420023
bias_match=1
#classes=18
classes=6
coords=4
num=6
softmax=1
jitter=.2		
rescore=1

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1

absolute=1
thresh = .6
random=0
